// Реализация шагов BDD-фич/сценариев c помощью фреймворка https://github.com/artbear/1bdd
// #Использовать "../../src"


Перем БДД; //контекст фреймворка 1bdd

// Метод выдает список шагов, реализованных в данном файле-шагов
Функция ПолучитьСписокШагов(КонтекстФреймворкаBDD) Экспорт
	БДД = КонтекстФреймворкаBDD;

	ВсеШаги = Новый Массив;

	ВсеШаги.Добавить("ЕстьКаталогСИсходникамиПоПути");
	ВсеШаги.Добавить("ВКаталогПустой");
	ВсеШаги.Добавить("КаталогНеПустой");

	Возврат ВсеШаги;
КонецФункции

// Реализация шагов

// Процедура выполняется перед запуском каждого сценария
Процедура ПередЗапускомСценария(Знач Узел) Экспорт
	
КонецПроцедуры

// Процедура выполняется после завершения каждого сценария
Процедура ПослеЗапускаСценария(Знач Узел) Экспорт
	
КонецПроцедуры


//Есть каталог с исходниками по пути "./example/1C"
Процедура ЕстьКаталогСИсходникамиПоПути(Знач ПарамСтрока1) Экспорт
	// Сообщить(ПарамСтрока1);
	//ВызватьИсключение Новый ИнформацияОбОшибке("Шаг <ЕстьКаталогСИсходникамиПоПути> не реализован", "Не реализовано.");
КонецПроцедуры

//в каталог "./example/EDT" пустой
Процедура ВКаталогПустой(Знач ПарамСтрока1) Экспорт
	// ВызватьИсключение Новый ИнформацияОбОшибке("Шаг <ВКаталогПустой> не реализован", "Не реализовано.");
КонецПроцедуры

//каталог "<КаталогПроекта>/example/EDT" не пустой
Процедура КаталогНеПустой(Знач ПарамСтрока1) Экспорт
	ВызватьИсключение Новый ИнформацияОбОшибке("Шаг <КаталогНеПустой> не реализован", "Не реализовано.");
КонецПроцедуры
